In [1]:
import pandas as pd
import numpy as np

# NA

- isnull()

In [2]:
series_obj = pd.Series([1, None, np.NaN])

In [3]:
pd.isnull(series_obj)

0    False
1     True
2     True
dtype: bool

In [4]:
series_obj.isna()

0    False
1     True
2     True
dtype: bool

- dropna()

In [5]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})
df

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [15]:
df.dropna(axis=0, subset=['toy', 'born'], how='any')

     name        toy       born
1  Batman  Batmobile 1940-04-25

- fillna()

In [16]:
df = pd.DataFrame([[np.nan, 2, np.nan, 0],
                   [3, 4, np.nan, 1],
                   [np.nan, np.nan, np.nan, np.nan],
                   [np.nan, 3, np.nan, 4]],
                  columns=list("ABCD"))
df

     A    B   C    D
0  NaN  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  NaN  NaN NaN  NaN
3  NaN  3.0 NaN  4.0

In [19]:
df.fillna(value={'A':999})

       A    B   C    D
0  999.0  2.0 NaN  0.0
1    3.0  4.0 NaN  1.0
2  999.0  NaN NaN  NaN
3  999.0  3.0 NaN  4.0

In [20]:
df.fillna(method='ffill')

     A    B   C    D
0  NaN  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  3.0  4.0 NaN  1.0
3  3.0  3.0 NaN  4.0

# Duplicates

- .duplicated() 

  - Detect which rows are duplicated 
  - Remove the duplicated rows by reverse slicing([~...])

In [5]:
df = pd.DataFrame({
    'brand': ['Yum Yum', 'Yum Yum', 'Indomie', 'Indomie', 'Indomie'],
    'style': ['cup', 'cup', 'cup', 'pack', 'pack'],
    'rating': [4, 4, 3.5, 15, 5]
})
df

     brand style  rating
0  Yum Yum   cup     4.0
1  Yum Yum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

In [18]:
''' By default, it detects all columns '''
df.duplicated()

0    False
1     True
2    False
3    False
4    False
dtype: bool

In [19]:
''' Specify which column(s) to detect '''
df.duplicated(subset=['style'])

0    False
1     True
2     True
3    False
4     True
dtype: bool

In [6]:
df.duplicated(keep='first')

0    False
1     True
2    False
3    False
4    False
dtype: bool

In [20]:
df_nondup = df[~df.duplicated(keep='first')]
df_nondup

     brand style  rating
0  Yum Yum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

- .drop_duplicates()

In [21]:
df = pd.DataFrame({
    'brand': ['Yum Yum', 'Yum Yum', 'Indomie', 'Indomie', 'Indomie'],
    'style': ['cup', 'cup', 'cup', 'pack', 'pack'],
    'rating': [4, 4, 3.5, 15, 5]
})
df

     brand style  rating
0  Yum Yum   cup     4.0
1  Yum Yum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

In [22]:
''' By default, it detects all columns '''
df.drop_duplicates()

     brand style  rating
0  Yum Yum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

In [25]:
df.drop_duplicates(subset=['brand'], keep='first')

     brand style  rating
0  Yum Yum   cup     4.0
2  Indomie   cup     3.5

# Data Type

In [24]:
d = {'col1': [1, 2], 'col2': [3, 4]}
df = pd.DataFrame(data=d)
df

   col1  col2
0     1     3
1     2     4

In [26]:
df.astype({'col1': 'int32'}).dtypes

col1    int32
col2    int64
dtype: object